Upgraded README file
